output/posts/slovak-learning/index.org
#+BEGIN_COMMENT
.. title: Slovak Learning
.. slug: slovak-learning
.. date: 2020-05-16 09:45:34 UTC+02:00
.. tags: Slovak
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

#+BEGIN_EXPORT html
<br>
<br>
#+END_EXPORT

Ok. This post is likely not interesting for any visitor. I am learning
the language and after a discussion with my girlfriend it turned out I
rather write down the new vocabulary for learning the language the
fastest.

In this post I write down my progress and I can go back to it at later
stages.


{{{TEASER_END}}}

#+BEGIN_EXPORT html
<br>
#+END_EXPORT


* Chapter Tages-Programm

** General Vocabular

 - čižmy = stivali

 - dovolenku/prázdniny = vacanza

 - dáždnik = ombrello

 - fajčiť = fumare

 - hladný = affamato

 - horúce = caldo 

 - jesť = mangiare

 - končiť sa  = finire

 - krátky = corto

 - kúpeme sa = fare il bagno (al mare)

 - lyžujeme sa = sciare

 - nosiť = indossare

 - nový ročník na univerzite = new university year

 - obchod = negozio

 - opaľujeme sa = prendere il sole.

 - plavky = costume da bagno

 - počasie = tempo 

 - posledný = ultimo

 - prší = piove

 - prázdniny = vacanze

 - prvý = primo

 - ročné obdobia = stagioni

 - rukavice = guanti

 - sneh = neve

 - sneží = nevica

 - študovať = studiare

 - teplé = caldo 

 - trochu = un po'

 - týždni = week

 - včera = ieri

 - vnučka = nipote

 - zabávať = intrattenere

 - zajtra = domani

 - začínať = iniziare

** Days of the Week

+----------------+-------------------+
|                |                   |
|      Deň       |  Koľký v týždni?  |
|                |                   |
+----------------+-------------------+
|    pondelok    |       prvý        |
+----------------+-------------------+
|     utorok     |       druhý       |
+----------------+-------------------+
|     streda     |       tretí       |
+----------------+-------------------+
|    štvrtok     |      štvrtý       |
+----------------+-------------------+
|     piatok     |       piaty       |
+----------------+-------------------+
|     sobota     |      šiesty       |
+----------------+-------------------+
|     nedeľa     |      siedmy       |
+----------------+-------------------+

** Months of the year


+-------------+-----------------+-----------------+
|             |                 |                 |
|   Mesiac    |  Koľký v roku?  |  Ročné Obdobia  |
|             |                 |                 |
+-------------+-----------------+-----------------+
|   január    |      prvý       |      zima       |
+-------------+-----------------+-----------------+
|   február   |      druhý      |      zima       |
+-------------+-----------------+-----------------+
|    marec    |      tretí      |       jar       |
+-------------+-----------------+-----------------+
|    apríl    |     štvrtý      |       jar       |
+-------------+-----------------+-----------------+
|     máj     |      piaty      |       jar       |
+-------------+-----------------+-----------------+
|     jún     |     šiesty      |      leto       |
+-------------+-----------------+-----------------+
|     júl     |     siedmy      |      leto       |
+-------------+-----------------+-----------------+
|   august    |      ôsmy       |      leto       |
+-------------+-----------------+-----------------+
|  september  |     deviaty     |      jeseň      |
+-------------+-----------------+-----------------+
|   október   |     desiaty     |      jeseň      |
+-------------+-----------------+-----------------+
|  november   |    jedenásty    |      jeseň      |
+-------------+-----------------+-----------------+
|  december   |    dvanásty     |      zima       |
+-------------+-----------------+-----------------+

** Numbers

+---------------+---------------+---------------+---------------+
|1              |jeden          |11             |jedenásť       |
+---------------+---------------+---------------+---------------+
|2              |dva            |12             |dvanást'       |
+---------------+---------------+---------------+---------------+
|3              |tri            |13             |trinást'       |
+---------------+---------------+---------------+---------------+
|4              | štyri         |14             |štrnást'       |
+---------------+---------------+---------------+---------------+
|5              |pat'           |15             |pätnást        |
+---------------+---------------+---------------+---------------+
|6              | šesť          |16             |šestnást       |
+---------------+---------------+---------------+---------------+
|7              |sedem          |17             |sedemnást      |
+---------------+---------------+---------------+---------------+
|8              |osem           |18             |osemnást       |
+---------------+---------------+---------------+---------------+
|9              |devät'         |19             |devätnást      |
+---------------+---------------+---------------+---------------+
|10             |desat'         |20             |dvadsát        |
+---------------+---------------+---------------+---------------+

+---------------+----------------------+
|21             |dvadsaťjeden          |
+---------------+----------------------+
|22             |dvadsaťdva            |
+---------------+----------------------+
|23             |dvadsaťtri            |
+---------------+----------------------+
|24             |dvadsaťštyri          |
+---------------+----------------------+
|25             |dvadsaťpät'           |
+---------------+----------------------+
|26             |dvadsaťšesť           |
+---------------+----------------------+
|27             |dvadsaťsedem          |
+---------------+----------------------+
|28             |dvadsaťosem           |
+---------------+----------------------+
|29             |dvadsaťdevät'         |
+---------------+----------------------+
|30             |trisat'               |
+---------------+----------------------+


+---------------+---------------+----------------+---------------+---------------+
|40             |50             |60              |70             |80             |
+---------------+---------------+----------------+---------------+---------------+
|štyridsat'     |pätdesiat'     |šestdesiat      | sedemdesiat   |osemdesiat     |
+---------------+---------------+--------------- +---------------+---------------+

+---------------+---------------+---------------+---------------+
|90             |100            |1000           |10 000         |
+---------------+---------------+---------------+---------------+
|devät'destiat  |sto            |tisíc          |milión         |
+---------------+---------------+---------------+---------------+

** Modalverben

- musiet' = müssen

+------------------+---------------+
|ja musim          |my musíme      |
+------------------+---------------+
|ty musíš          |vy musíte      |
+------------------+---------------+
|on/ona/ono musí   |oni/ony musia  |
+------------------+---------------+

#+BEGIN_EXPORT html
<br>
#+END_EXPORT

- môcť = können, dürfen

+------------------+---------------+
|ja môžem          |my môžeme      |
+------------------+---------------+
|ty môžeš          |vy môžete      |
+------------------+---------------+
|on/ona/ono môže   |oni/ony môžu   |
+------------------+---------------+

#+BEGIN_EXPORT html
<br>
#+END_EXPORT

-  chiect' = wollen

+------------------+-----------------+
|ja chcem          |my chceme        |
+------------------+-----------------+
|ty chceš          |vy chcete        |
+------------------+-----------------+
|on/ona/ono chce   |oni/ony chcú     |
+------------------+-----------------+

#+BEGIN_EXPORT html
<br>
#+END_EXPORT


- mat' = sollen

+------------------+---------------+
|ja mám            |my máme        |
+------------------+---------------+
|ty máš            |vy máte        |
+------------------+---------------+
|on/ona/ono má     |oni/ony majú   |
+------------------+---------------+

#+BEGIN_EXPORT html
<br>
#+END_EXPORT

- smiet' = dürfen

+------------------+---------------+
|ja smiem          |my smieme      |
+------------------+---------------+
|ty smieš          |vy smiete      |
+------------------+---------------+
|on/ona/ono smie   |oni/ony smú    |
+------------------+---------------+


#+BEGIN_EXPORT html
<br>
#+END_EXPORT

- vedieť = wissen, können (Fähigkeit haben), kennen

+------------------+---------------+
|ja viem           |my vieme       |
+------------------+---------------+
|ty vieš           |vy viete       |
+------------------+---------------+
|on/ona/ono vie    |oni/ony vedia  |
+------------------+---------------+


Notice that with all the modal verbs you use verbs in their infinite
form like with all the languages you know so far. For instance:

Doobeda musím *byť* v škole a musím *študovať*.

** Prepositions

 + Idem do domu. <=> Ich gehe *nach* Hause.
 + Idem od domu. <=> Ich gehe *aus der Nähe* von dem Haus.
 + Idem z domu.  <=> Ich gehe *aus* dem Haus.
 + Ja som v doma <=> Ich bin *in dem* Haus



