output/posts/slovak-learning/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Slovak Learning | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/slovak-learning/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<link rel="prev" href="../rdds-transformations-and-actions/" title="RDDs Transformations and Actions" type="text/html">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="Slovak Learning">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/slovak-learning/">
<meta property="og:description" content="Ok. This post is likely not interesting for any visitor. I am learning
the language and after a discussion with my girlfriend it turned out I
rather write down the new vocabulary for learning the lang">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-05-16T09:45:34+02:00">
<meta property="article:tag" content="Slovak">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user-circle"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-edit"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
            <li><a href="../../pages/emacs/" title="A life Configuring Emacs"><i class="fa fa-code"></i></a></li>
            <li><a href="../../pages/papers/" title="Term and Research Papers"><i class="fa fa-university"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="https://stackoverflow.com/users/9731177/mhass" title="My Stack"><i class="fab fa-stack-overflow"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Slovak Learning</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2020-05-16T09:45:34+02:00" itemprop="datePublished" title="2020-05-16 09:45">2020-05-16 09:45</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> Tags:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/slovak/" rel="tag">Slovak</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <br><br><p>
Ok. This post is likely not interesting for any visitor. I am learning
the language and after a discussion with my girlfriend it turned out I
rather write down the new vocabulary for learning the language the
fastest.
</p>

<p>
In this post I write down my progress and I can go back to it at later
stages.
</p>


<!-- TEASER_END -->

<br><div id="outline-container-org1942b15" class="outline-2">
<h2 id="org1942b15">Chapter Tages-Programm</h2>
<div class="outline-text-2" id="text-org1942b15">
</div>
<div id="outline-container-org0dbfe2a" class="outline-3">
<h3 id="org0dbfe2a">General Vocabular</h3>
<div class="outline-text-3" id="text-org0dbfe2a">
<ul class="org-ul">
<li>čižmy = stivali</li>

<li>dovolenku/prázdniny = vacanza</li>

<li>dáždnik = ombrello</li>

<li>fajčiť = fumare</li>

<li>hladný = affamato</li>

<li>horúce = caldo</li>

<li>jesť = mangiare</li>

<li>končiť sa  = finire</li>

<li>krátky = corto</li>

<li>kúpeme sa = fare il bagno (al mare)</li>

<li>lyžujeme sa = sciare</li>

<li>nosiť = indossare</li>

<li>nový ročník na univerzite = new university year</li>

<li>obchod = negozio</li>

<li>opaľujeme sa = prendere il sole.</li>

<li>plavky = costume da bagno</li>

<li>počasie = tempo</li>

<li>posledný = ultimo</li>

<li>prší = piove</li>

<li>prázdniny = vacanze</li>

<li>prvý = primo</li>

<li>ročné obdobia = stagioni</li>

<li>rukavice = guanti</li>

<li>sneh = neve</li>

<li>sneží = nevica</li>

<li>študovať = studiare</li>

<li>teplé = caldo</li>

<li>trochu = un po'</li>

<li>týždni = week</li>

<li>včera = ieri</li>

<li>vnučka = nipote</li>

<li>zabávať = intrattenere</li>

<li>zajtra = domani</li>

<li>začínať = iniziare</li>
</ul>
</div>
</div>

<div id="outline-container-org133866b" class="outline-3">
<h3 id="org133866b">Days of the Week</h3>
<div class="outline-text-3" id="text-org133866b">
<!-- This HTML table template is generated by emacs 28.0.50 -->
<table border="1">
<tr>
<td align="left" valign="top">
                      <br>
            Deň       <br>
                      
    </td>
    <td align="left" valign="top">
                         <br>
        Koľký v týždni?  <br>
                         
    </td>
  </tr>
<tr>
<td align="left" valign="top">
          pondelok    
    </td>
    <td align="left" valign="top">
             prvý        
    </td>
  </tr>
<tr>
<td align="left" valign="top">
           utorok     
    </td>
    <td align="left" valign="top">
             druhý       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
           streda     
    </td>
    <td align="left" valign="top">
             tretí       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
          štvrtok     
    </td>
    <td align="left" valign="top">
            štvrtý       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
           piatok     
    </td>
    <td align="left" valign="top">
             piaty       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
           sobota     
    </td>
    <td align="left" valign="top">
            šiesty       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
           nedeľa     
    </td>
    <td align="left" valign="top">
            siedmy       
    </td>
  </tr>
</table>
</div>
</div>

<div id="outline-container-org9ee45f1" class="outline-3">
<h3 id="org9ee45f1">Months of the year</h3>
<div class="outline-text-3" id="text-org9ee45f1">
<!-- This HTML table template is generated by emacs 28.0.50 -->
<table border="1">
<tr>
<td align="left" valign="top">
                   <br>
         Mesiac    <br>
                   
    </td>
    <td align="left" valign="top">
                       <br>
        Koľký v roku?  <br>
                       
    </td>
    <td align="left" valign="top">
                       <br>
        Ročné Obdobia  <br>
                       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
         január    
    </td>
    <td align="left" valign="top">
            prvý       
    </td>
    <td align="left" valign="top">
            zima       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
         február   
    </td>
    <td align="left" valign="top">
            druhý      
    </td>
    <td align="left" valign="top">
            zima       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
          marec    
    </td>
    <td align="left" valign="top">
            tretí      
    </td>
    <td align="left" valign="top">
             jar       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
          apríl    
    </td>
    <td align="left" valign="top">
           štvrtý      
    </td>
    <td align="left" valign="top">
             jar       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
           máj     
    </td>
    <td align="left" valign="top">
            piaty      
    </td>
    <td align="left" valign="top">
             jar       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
           jún     
    </td>
    <td align="left" valign="top">
           šiesty      
    </td>
    <td align="left" valign="top">
            leto       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
           júl     
    </td>
    <td align="left" valign="top">
           siedmy      
    </td>
    <td align="left" valign="top">
            leto       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
         august    
    </td>
    <td align="left" valign="top">
            ôsmy       
    </td>
    <td align="left" valign="top">
            leto       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
        september  
    </td>
    <td align="left" valign="top">
           deviaty     
    </td>
    <td align="left" valign="top">
            jeseň      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
         október   
    </td>
    <td align="left" valign="top">
           desiaty     
    </td>
    <td align="left" valign="top">
            jeseň      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
        november   
    </td>
    <td align="left" valign="top">
          jedenásty    
    </td>
    <td align="left" valign="top">
            jeseň      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
        december   
    </td>
    <td align="left" valign="top">
          dvanásty     
    </td>
    <td align="left" valign="top">
            zima       
    </td>
  </tr>
</table>
</div>
</div>

<div id="outline-container-orgb1222f2" class="outline-3">
<h3 id="orgb1222f2">Numbers</h3>
<div class="outline-text-3" id="text-orgb1222f2">
<!-- This HTML table template is generated by emacs 28.0.50 -->
<table border="1">
<tr>
<td align="left" valign="top">
      1              
    </td>
    <td align="left" valign="top">
      jeden          
    </td>
    <td align="left" valign="top">
      11             
    </td>
    <td align="left" valign="top">
      jedenásť       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      2              
    </td>
    <td align="left" valign="top">
      dva            
    </td>
    <td align="left" valign="top">
      12             
    </td>
    <td align="left" valign="top">
      dvanást'       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      3              
    </td>
    <td align="left" valign="top">
      tri            
    </td>
    <td align="left" valign="top">
      13             
    </td>
    <td align="left" valign="top">
      trinást'       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      4              
    </td>
    <td align="left" valign="top">
       štyri         
    </td>
    <td align="left" valign="top">
      14             
    </td>
    <td align="left" valign="top">
      štrnást'       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      5              
    </td>
    <td align="left" valign="top">
      pat'           
    </td>
    <td align="left" valign="top">
      15             
    </td>
    <td align="left" valign="top">
      pätnást        
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      6              
    </td>
    <td align="left" valign="top">
       šesť          
    </td>
    <td align="left" valign="top">
      16             
    </td>
    <td align="left" valign="top">
      šestnást       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      7              
    </td>
    <td align="left" valign="top">
      sedem          
    </td>
    <td align="left" valign="top">
      17             
    </td>
    <td align="left" valign="top">
      sedemnást      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      8              
    </td>
    <td align="left" valign="top">
      osem           
    </td>
    <td align="left" valign="top">
      18             
    </td>
    <td align="left" valign="top">
      osemnást       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      9              
    </td>
    <td align="left" valign="top">
      devät'         
    </td>
    <td align="left" valign="top">
      19             
    </td>
    <td align="left" valign="top">
      devätnást      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      10             
    </td>
    <td align="left" valign="top">
      desat'         
    </td>
    <td align="left" valign="top">
      20             
    </td>
    <td align="left" valign="top">
      dvadsát        
    </td>
  </tr>
</table>
<!-- This HTML table template is generated by emacs 28.0.50 --><table border="1">
<tr>
<td align="left" valign="top">
      21             
    </td>
    <td align="left" valign="top">
      dvadsaťjeden          
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      22             
    </td>
    <td align="left" valign="top">
      dvadsaťdva            
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      23             
    </td>
    <td align="left" valign="top">
      dvadsaťtri            
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      24             
    </td>
    <td align="left" valign="top">
      dvadsaťštyri          
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      25             
    </td>
    <td align="left" valign="top">
      dvadsaťpät'           
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      26             
    </td>
    <td align="left" valign="top">
      dvadsaťšesť           
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      27             
    </td>
    <td align="left" valign="top">
      dvadsaťsedem          
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      28             
    </td>
    <td align="left" valign="top">
      dvadsaťosem           
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      29             
    </td>
    <td align="left" valign="top">
      dvadsaťdevät'         
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      30             
    </td>
    <td align="left" valign="top">
      trisat'               
    </td>
  </tr>
</table>
<!-- This HTML table template is generated by emacs 28.0.50 --><table border="1">
<tr>
<td align="left" valign="top">
      40             
    </td>
    <td align="left" valign="top">
      50             
    </td>
    <td align="left" valign="top">
      60              
    </td>
    <td align="left" valign="top">
      70             
    </td>
    <td align="left" valign="top">
      80             
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      štyridsat'     
    </td>
    <td align="left" valign="top">
      pätdesiat'     
    </td>
  </tr>
</table>
<p>
<del>---------------</del>---------------<del>----------–— +---------------</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-right">
<col class="org-right">
<col class="org-right">
<col class="org-left">
</colgroup>
<tbody><tr>
<td class="org-right">90</td>
<td class="org-right">100</td>
<td class="org-right">1000</td>
<td class="org-left">10 000</td>
</tr></tbody>
</table>
<p>
<del>---------------</del>---------------<del>----------–— +---------------</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
<col class="org-left">
<col class="org-left">
</colgroup>
<tbody><tr>
<td class="org-left">devät'destiat</td>
<td class="org-left">sto</td>
<td class="org-left">tisíc</td>
<td class="org-left">milión</td>
</tr></tbody>
</table>
<p>
<del>---------------</del>---------------<del>----------–— +---------------</del>
</p>
</div>
</div>

<div id="outline-container-org7510654" class="outline-3">
<h3 id="org7510654">Modalverben</h3>
<div class="outline-text-3" id="text-org7510654">
<ul class="org-ul">
<li>musiet' = müssen</li>
</ul>
<!-- This HTML table template is generated by emacs 28.0.50 --><table border="1">
<tr>
<td align="left" valign="top">
      ja musim          
    </td>
    <td align="left" valign="top">
      my musíme      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      ty musíš          
    </td>
    <td align="left" valign="top">
      vy musíte      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      on/ona/ono musí   
    </td>
    <td align="left" valign="top">
      oni/ony musia  
    </td>
  </tr>
</table>
<ul class="org-ul">
<li>môcť = können, dürfen</li>
</ul>
<!-- This HTML table template is generated by emacs 28.0.50 --><table border="1">
<tr>
<td align="left" valign="top">
      ja môžem          
    </td>
    <td align="left" valign="top">
      my môžeme      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      ty môžeš          
    </td>
    <td align="left" valign="top">
      vy môžete      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      on/ona/ono môže   
    </td>
    <td align="left" valign="top">
      oni/ony môžu   
    </td>
  </tr>
</table>
<ul class="org-ul">
<li>chiect' = wollen</li>
</ul>
<!-- This HTML table template is generated by emacs 28.0.50 --><table border="1">
<tr>
<td align="left" valign="top">
      ja chcem          
    </td>
    <td align="left" valign="top">
      my chceme        
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      ty chceš          
    </td>
    <td align="left" valign="top">
      vy chcete        
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      on/ona/ono chce   
    </td>
    <td align="left" valign="top">
      oni/ony chcú     
    </td>
  </tr>
</table>
<ul class="org-ul">
<li>mat' = sollen</li>
</ul>
<!-- This HTML table template is generated by emacs 28.0.50 --><table border="1">
<tr>
<td align="left" valign="top">
      ja mám            
    </td>
    <td align="left" valign="top">
      my máme        
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      ty máš            
    </td>
    <td align="left" valign="top">
      vy máte        
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      on/ona/ono má     
    </td>
    <td align="left" valign="top">
      oni/ony majú   
    </td>
  </tr>
</table>
<ul class="org-ul">
<li>smiet' = dürfen</li>
</ul>
<!-- This HTML table template is generated by emacs 28.0.50 --><table border="1">
<tr>
<td align="left" valign="top">
      ja smiem          
    </td>
    <td align="left" valign="top">
      my smieme      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      ty smieš          
    </td>
    <td align="left" valign="top">
      vy smiete      
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      on/ona/ono smie   
    </td>
    <td align="left" valign="top">
      oni/ony smú    
    </td>
  </tr>
</table>
<ul class="org-ul">
<li>vedieť = wissen, können (Fähigkeit haben), kennen</li>
</ul>
<!-- This HTML table template is generated by emacs 28.0.50 --><table border="1">
<tr>
<td align="left" valign="top">
      ja viem           
    </td>
    <td align="left" valign="top">
      my vieme       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      ty vieš           
    </td>
    <td align="left" valign="top">
      vy viete       
    </td>
  </tr>
<tr>
<td align="left" valign="top">
      on/ona/ono vie    
    </td>
    <td align="left" valign="top">
      oni/ony vedia  
    </td>
  </tr>
</table>
<p>
Notice that with all the modal verbs you use verbs in their infinite
form like with all the languages you know so far. For instance:
</p>

<p>
Doobeda musím <b>byť</b> v škole a musím <b>študovať</b>.
</p>
</div>
</div>

<div id="outline-container-org2c8ca56" class="outline-3">
<h3 id="org2c8ca56">Prepositions</h3>
<div class="outline-text-3" id="text-org2c8ca56">
<ul class="org-ul">
<li>Idem do domu. &lt;=&gt; Ich gehe <b>nach</b> Hause.</li>
<li>Idem od domu. &lt;=&gt; Ich gehe <b>aus der Nähe</b> von dem Haus.</li>
<li>Idem z domu.  &lt;=&gt; Ich gehe <b>aus</b> dem Haus.</li>
<li>Ja som v doma &lt;=&gt; Ich bin <b>in dem</b> Haus</li>
</ul>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../rdds-transformations-and-actions/" rel="prev" title="RDDs Transformations and Actions">Previous post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2020         <a href="mailto:marco.hassan30@gmail.com">Marco Hassan</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
